{
    "level": "see your",
    "scenes": [{
            "name": "Introduction",
            "dialog": [
                0,
                1,
                2,
                3
            ]
        },
        {
            "name": "Chatter about auckland population",
            "dialog": [
                4,
                5,
                6,
                7
            ]
        },
        {
            "name": "So she is telling you that she is studying medicine",
            "dialog": [
                8,
                9,
                10,
                11
            ]
        },
        {
            "name": "Step 4: [photo of smiling girl]",
            "dialog": [
                12,
                13,
                14,
                15
            ]
        },
        {
            "name": "Step 5: [photo of smiling girl] girl:",
            "dialog": [
                16,
                17,
                18,
                19
            ]
        }
    ],
    "dialogs": [{
            "line": "Hello, beautiful! You look a little bit tired. Do you need a free massage?",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Hey! May I ask you a little question? Do you know how many people live in Auckland?",
            "attarction": 0,
            "uniqueness": 1,
            "scene": 1,
            "response": 1
        },
        {
            "line": "Good morning! Wow! You are so beautiful! May I get coffee for you?",
            "attarction": 1,
            "uniqueness": 0,
            "scene": 2,
            "response": 0
        },
        {
            "line": "Hello! I see you are very busy at the moment, but I just could not ignore that feeling which I got when I saw you in the crowd. Maybe we could have a drink sometimes?",
            "attarction": 0,
            "uniqueness": 0,
            "scene": 3,
            "response": 0
        },
        {
            "line": "Wow! That is a lot of people..  What is making you different from all those 2 million? ",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Gosh! Two million! Why it is so hard to find a person for sharing food? Maybe we could talk about it over the dinner?",
            "attarction": 0,
            "uniqueness": 1,
            "scene": 4,
            "response": 0
        },
        {
            "line": "Wow! Seems like you know a lot of things about this city! Maybe you could tell me more while we are having dinner together?",
            "attarction": 1,
            "uniqueness": -1,
            "scene": 4,
            "response": 0
        },
        {
            "line": "Too bad I can’t buy coffee for all 2 million.. Maybe I could buy one for you at least? ",
            "attarction": 1,
            "uniqueness": 0,
            "scene": "3",
            "response": 0
        },
        {
            "line": "Oh, cool! My ex-girlfriend is a doctor, she could be quite annoying sometimes with her medical advice",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Interesting! Where are you studying? In Auckland University? Are there some nice places for dinner around?",
            "attarction": 1,
            "uniqueness": 0,
            "scene": 5,
            "response": 0
        },
        {
            "line": "Oh, that is cool! I have a rare disorder - I bring flowers for the person with who I am going to have dinner. I will show you! I only need your number so we could make an appointment.",
            "attarction": 1,
            "uniqueness": 1,
            "scene": 6,
            "response": 0
        },
        {
            "line": "I am very lucky! I have something on my skin right here, could you have a look?",
            "attarction": -1,
            "uniqueness": 0,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Would you prefer to have a drink or dinner? Not sure if I can afford dinner.. ",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Oh, wow! I am so lucky to get “yes”! I try my luck one more time: may I get your number? ",
            "attarction": 1,
            "uniqueness": 0,
            "scene": 5,
            "response": 0
        },
        {
            "line": "Do you know some good place for dinner? I don’t go out much so I would be happy if you choose the place! ",
            "attarction": 1,
            "uniqueness": 0,
            "scene": 4,
            "response": 0
        },
        {
            "line": "I am vegan, so let me choose the place. You should switch to a vegan diet as well, it is very good for your health. ",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Is there any chance to try this place with you? My treat!.. Could I get your number so we could arrange the meeting? ",
            "attarction": -1,
            "uniqueness": 1,
            "scene": 5,
            "response": 0
        },
        {
            "line": "You have to show me this place! Could I get your number so I could let you know when I am free? ",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        },
        {
            "line": "Oh, no!!! I have this weird allergy on the checkered tablecloth! Maybe I could invite you to Very Nice Place instead? There are nice wooden tables and no tablecloths at all! ",
            "attarction": 1,
            "uniqueness": 1,
            "scene": 5,
            "response": 0
        },
        {
            "line": "Italian? Oh no, my ex was Italian, I still trying to get over that relationship. No Italian please. ",
            "attarction": -1,
            "uniqueness": -1,
            "scene": 0,
            "response": 0
        }
    ],
    "responses": [
        "Sorry I don't want to discuss that",
        "About 2 million I guess",
        "that would be nice",
        "yes, there is a nice Italian place nearby"
    ]
}